# TypeId Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
AlignmentStationLabelOptions..::..TypeId Property
AlignmentStationLabelOptions Class See Also
---
Specifies the ElementId of the label type. The default value is InvalidElementId. In this case, the default type id for alignment station labels in the document is used.
**Namespace:** Autodesk.Revit.DB.Infrastructure**Assembly:** Autodesk.CivilAlignments.DBApplication (in Autodesk.CivilAlignments.DBApplication.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021.1
# Syntax
C#
---
```text
public ElementId TypeId { get; set; }
```

Visual Basic
---
```text
Public Property TypeId As ElementId
	Get
	Set
```

Visual C++
---
```text
public:
property ElementId^ TypeId {
	ElementId^ get ();
	void set (ElementId^ value);
}
```

# Remarks
Valid types can be found using IsValidType(Element).
# See Also
AlignmentStationLabelOptions Class
Autodesk.Revit.DB.Infrastructure Namespace